[{"_id": {"$oid": "609b5352f9449eb64edfacfd"}, "titulo": "Pfc do Marcos Paulo Lima", "autores": "Marcos Paulo", "orientadores": "PR", "InstEns": "Instituto Militar de Engenharia (IME)", "tipo": "pfc", "keyword": "roboticavcvbcvb", "resumo": "Robotica", "data": "12/05/2021"}, {"_id": {"$oid": "609b55646d0f0db37a05bd27"}, "titulo": "PFC do Testoni Atala", "autores": "Testoni", "orientadores": "Ronaldo", "InstEns": "IME", "tipo": "pfc", "keyword": "ime", "resumo": "IA", "data": "12/05/2021"}, {"_id": {"$oid": "609b566460a64c8c3e1fc654"}, "titulo": "PFC do Amigo", "autores": "Marcos Paulo", "orientadores": "PR", "InstEns": "IME", "tipo": "pfc", "keyword": "robotica", "resumo": "Robotica", "data": "12/05/2021"}, {"_id": {"$oid": "609b568260a64c8c3e1fc655"}, "titulo": "PFC do Testoni", "autores": "Marcos Paulo", "orientadores": "PR", "InstEns": "IME", "tipo": "pfc", "keyword": "robotica", "resumo": "Robotica", "data": "12/05/2021"}, {"_id": {"$oid": "609b57862cc9b5d04db7db81"}, "titulo": "PFC do Testoni", "autores": "Marcos Paulo", "orientadores": "PR", "InstEns": "IME", "tipo": "pfc", "keyword": "robotica", "resumo": "Inteligencia Artificial", "data": "12/05/2021"}, {"_id": {"$oid": "609b5a8906f041c6e51329e4"}, "titulo": "PFC do Testoni", "autores": "Marcos Paulo", "orientadores": "PR", "InstEns": "IME", "tipo": "pfc", "keyword": "robotica", "resumo": "Robotica", "data": "12/05/2021"}, {"_id": {"$oid": "609b5da35536b1bc8cb1afaa"}, "titulo": "Teste", "autores": "DP, MP", "orientadores": "Obama", "InstEns": "IME", "tipo": "pfc", "keyword": "Socorro", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b5ded5536b1bc8cb1afab"}, "titulo": "Teste", "autores": "DP, MP", "orientadores": "Obama", "InstEns": "IME", "tipo": "pfc", "keyword": "Socorro", "resumo": "fdfdfd", "data": "12/05/2021"}, {"_id": {"$oid": "609b5f2f40f30acaeb0a8602"}, "titulo": "Teste", "autores": "DP, MP", "orientadores": "Obama", "InstEns": "IME", "tipo": "pfc", "keyword": "Socorro", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b5f5740f30acaeb0a8603"}, "titulo": "Teste", "autores": "DP, MP", "orientadores": "Obama", "InstEns": "IME", "tipo": "pfc", "keyword": "Socorro", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b60205abd4d1f3d1ad1c5"}, "titulo": "Teste Final", "autores": "DP, MP", "orientadores": "Jorge", "InstEns": "IME", "tipo": "pfc", "keyword": "Help", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b60bd85181094fc62dfa3"}, "titulo": "Teste Final", "autores": "DP, MP", "orientadores": "Jorge", "InstEns": "IME", "tipo": "pfc", "keyword": "Help", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b60e13a7f3562693a7d7e"}, "titulo": "Teste Final", "autores": "DP, MP", "orientadores": "Jorge", "InstEns": "IME", "tipo": "pfc", "keyword": "Help", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "609b61288643a45fac76fb59"}, "titulo": "Teste Final", "autores": "DP, MP", "orientadores": "Jorge", "InstEns": "IME", "tipo": "pfc", "keyword": "Help", "resumo": ":)", "data": "12/05/2021"}, {"_id": {"$oid": "60a26fef9395a60c62bdeeef"}, "titulo": "Apresentaçãooo", "autores": "DP, MP", "orientadores": "TC Anderson", "InstEns": "IME", "tipo": "pfc", "keyword": "LabProg", "resumo": ":)", "data": "17/05/2021"}, {"_id": {"$oid": "60a3c0b0ed2f02a8609e5d8f"}, "titulo": "Pfc do Marcos", "autores": "Marcos Paulo, Joaozinho", "orientadores": "Ronaldo", "InstEns": "IME", "tipo": "pfc", "keyword": "ime", "resumo": "Robotica", "data": "18/05/2021"}, {"_id": {"$oid": "60a41fe173d13df00083a735"}, "titulo": "tuning_esquema", "autores": "yoko", "orientadores": "yoko", "InstEns": "ime", "tipo": "pfc", "keyword": "chave", "resumo": "resumido", "data": "18/05/2021", "filename": "Tarefa_Tunning_de_Esquema.pdf"}, {"_id": {"$oid": "60a42497c51ab22ac04cc9b8"}, "titulo": "Camila", "autores": "CAMILA ANTONACCIO WANOUS, JOÃO LUIZ DO PRADO NETO", "orientadores": "Maria Claudia Reis Cavalcanti, Claudia Marcela Justel", "InstEns": "IME", "tipo": "pfc", "keyword": "Predição de Ligações, Grafos, Banco de Dados, Visualização.", "resumo": "A visualização de grafos pode dizer muito acerca das informações armazenadas. Atualmente as formas existentes para a visualização desse tipo de informação não são tão diversi\u001ccadas a ponto de atender as necessidades de todos os usuários, como por exemplo prever ligações futuras. Tendo isto como base e outros trabalhos desenvolvidos na própria instituição pretende-se criar uma ferramenta que ofereça ao usuário a predição de ligações, além de um sistema que integre banco de dados e visualização dos dados. Um exemplo prático de aplicação é a rede de colaboração de pesquisadores, na qual pode-se ter nós que representam os autores, as publicações e os veículos no qual a publicação foi feita e por meio destas informações gerar-se predições a respeito de autores que poderiam publicar juntos ou de novos veículos de publicação para um autor. Por meio da predição de ligações, pode-se obter informações mais detalhadas sobre os dados e de como eles interagem. A título, tem-se a possibilidade de avaliar a evolução da rede em sua formação de conexões ou de servir como ferramenta comercial para empresas que desejem fazer anúncios inteligentes; isto é oferecer seus produtos a pessoas com maior probabilidade de adquiri-los.", "data": "18/05/2021", "filename": "2015-Camila_Joao.pdf"}, {"_id": {"$oid": "60a8532ce2a02c19b8e2371c"}, "titulo": "Teste local", "autores": "Marcos Paulo", "orientadores": "", "InstEns": "", "tipo": "pfc", "keyword": "", "resumo": "", "data": "21/05/2021", "filename": "relatorio_3.pdf"}, {"_id": {"$oid": "60a85e819dbef838f07d7f3b"}, "titulo": "ALOCA¸C˜AO ROBUSTA DE POLOS SOB RESTRI ¸C˜OESESTRUTURAIS NO CONTROLADOR", "autores": "JO˜AO F´ABIO SOARES DOS SANTOS", "orientadores": "Orientadores: Prof. Alberto Mota Sim˜oes, Dr. ISProf. Paulo C´esar Pellanda, Dr. E", "InstEns": "", "tipo": "pfc", "keyword": "", "resumo": "Uma nova t´ecnica de s´ıntese de controladores, por realimenta¸c˜ao de sa´ıda, ´e apre-sentada a qual permite o projeto de sistemas de controle com agrupamento regional erobusto de polos, na presen¸ca de incertezas param´etricas e satisfazendo restri¸c˜oes estrutu-rais prescritas. Tais caracter´ısticas est˜ao raramente conjuntamente presentes nos m´etodosde s´ıntese de controladores dispon´ıveis atualmente. A ideia central da abordagem de-senvolvida consiste em reformular o problema original de aloca¸c˜ao robusta de polos emum problema de estabiliza¸c˜ao robusta equivalente, envolvendo controladores e incertezasaltamente estruturados. Al´em disso, as incertezas param´etricas podem aparecer repeti-damente.As especifica¸c˜oes de desempenho no dom´ınio do tempo s˜ao obtidas pela aplica¸c˜aoda t´ecnica cl´assica para s´ıntese de controladores, que se baseia na influˆencia dos polosdominantes do sistema em malha fechada. No entanto, a posi¸c˜ao dos zeros e demais polosdo sistema pode interferir no seu desempenho temporal. Assim sendo, uma abordagemmista ´e tamb´em constru´ıda considerando a norma H∞ de um canal de desempenho paraobten¸c˜ao das especifica¸c˜oes desejadas.Aplica¸c˜oes num´ericas envolvendo sistemas de engenharia desafiadores corroborarama aplicabilidade da t´ecnica de s´ıntese desenvolvida com a obten¸c˜ao de resultados conside-rados satisfat´orios.15", "data": "21/05/2021", "filename": "TESE_MajSoares-VFinal-15Abr19.pdf"}, {"_id": {"$oid": "60a85ed79dbef838f07d7f3c"}, "titulo": "DESCOBERTA DE REGRAS DE ASSOCIAÇÃO ENTRE DATASETS: UMAABORDAGEM INCLUINDO A GERAÇÃO DE REGRAS RARAS", "autores": "GUILHERME DOS SANTOS VILLOTE, RAÍSSA DUTRA DE OLIVEIRA", "orientadores": "Maria Cláudia Reis Cavalcanti, ", "InstEns": "", "tipo": "pfc", "keyword": " mineração de regras de associação. regras raras. web de dados. RDF.", "resumo": "Esse trabalho está estreitamente relacionado à necessidade atual de lidar com a grandequantidade de dados presentes na Web de dados, de forma que seja possível geri-los eutilizá-los para extrair informações úteis. Para que seja possível atingir esse objetivo, muitotem sido feito a fim de padronizar a forma de representação desses dados. Iniciativas comoa Web Semântica e o formato RDF tornaram os dados inteligíveis tanto por máquinasquanto por humanos, além de facilitar a interoperabilidade entre os diversos conjuntos dedados disponibilizados publicamente na Web.Várias ferramentas foram desenvolvidas priorizando a mineração de regras de associaçãoentre os dados de um banco. Neste trabalho foram estudados o algoritmo MRAR e aferramenta MRAR , onde esta última tem como objetivo buscar enriquecer um datasetalvo a partir de datasets externos no âmbito da Web de Dados.O objetivo principal deste trabalho é apresentar uma ferramenta baseada em uma novatécnica de mineração de regras raras combinada com o algoritmo MRAR e com a técnica deenriquecimento do dataset apresentada pelo MRAR . Essa nova técnica de mineração sepropõe a identificar regras raras que costumam ser ignoradas pela maioria dos algoritmosdisponíveis no mercado devido ao conceito de suporte mínimo que eles utilizam. Assim,uma solução para o problema de regras raras foi identificada e implementada junto coma abordagem do MRAR  em Java. Além disso, foram realizados dois estudos de caso afim de validar a solução apresentada e mostrar uma aplicação prática para a mesma. Oprincipal deles utilizou um banco de dados de médio porte sobre Botânica, cujos dadosforam extraídos de um banco de dados real, pertencente ao Instituto Jardim Botânico doRio de Janeiro.Palavras-chave: mineração de regras de associação. regras raras. web de dados. RDF.", "data": "21/05/2021", "filename": "PFC_VilloteRaissa.pdf"}, {"_id": {"$oid": "60a85f979dbef838f07d7f3d"}, "titulo": "LUDOCUS - FERRAMENTA DE GAMIFICAÇÃO PARA QUALQUEREXPERIÊNCIA", "autores": "BRUNELLI GABRIEL CUPELLOFÁBIO HENRIQUE DATOLLA", "orientadores": "iiiiiorienta-ii", "InstEns": "", "tipo": "pfc", "keyword": " Gamificação. Ensino. Aprendizagem. Jogos.", "resumo": "Na geração atual, ninguém fica mais parado. Todos são sobrecarregados com infor-mações novas 24 horas por dia. Ninguém mais precisa ler revistas na sala de espera doconsultório médico, nem olhar para a paisagem no trajeto do ônibus para passar o tempo.Assim, não é uma surpresa o fato de muitos alunos apresentarem dificuldades em seconcentrar nas aulas, onde, em alguns casos, não há um estímulo suficiente. Aspessoas sempre têm algo a fazer mais interessante do que suas atividades atuais. Com isso,elas perdem o foco nas atividades do dia a dia e esquecem o que é importante.A gamificação, através do estudo da forma como as pessoas engajam em suas experiênci-ais, apresenta-se como uma solução para motivar e facilitar a execução de tarefas deestudo, trabalho e até mesmo o uso de sistemas de informação.Dessa forma, este trabalho desenvolveu uma solução para, integrada a uma ferra-menta de visualização de dados, gamificar experiências no processo de ensino-aprendizagem em instituições de ensino, tornando as mesmas divertidas, favorecendoo aumento do engajamento de alunos e professores.Palavras-chave: Gamificação. Ensino. Aprendizagem. Jogos.", "data": "21/05/2021", "filename": "PFC_Brunelli_Datolla.pdf"}, {"_id": {"$oid": "60a8607921ef9c54a5cc8a35"}, "titulo": "CLASSIFICAÇÃO DE MALWARE UTILIZANDO ANÁLISE ESTÁTICA EREDES NEURAIS RECORRENTES", "autores": "1o Ten DAVI GOMES DE ALBUQUERQUE1o Ten LINCOLN DE QUEIROZ VIEIRA", "orientadores": "Orientador: TC Julio Cesar Duarte - D.Sc.Co-Orientador: TC Ricardo Sant’Ana - M.Sc.", "InstEns": "", "tipo": "pfc", "keyword": "malware", "resumo": "A internet é palco de milhares de ataques cibernéticos todos os dias. Uma das maiores ameaças que afetam empresas e até usuários comuns são malware, software maliciosos que infectam computadores com o objetivo de modificar seu funcionamento. Companhias de antivírus tentam aumentar a eficácia dos métodos de detecção de vírus, mas o grande aumento do número de variações de malware com o uso de técnicas como ofuscação aumenta a cada dia, tornando seu trabalho cada vez mais complexo e difícil. A utilização de redes neurais tem se mostrado cada vez mais presente na construção de algoritmos decisórios, inclusive na construção de classificadores de malware. Esse trabalho tem o objetivo de aplicar redes neurais recorrentes para prever os opcodes de um malware e, em seguida, classificá-los. Essa abordagem é inovadora pois, nos trabalhos analisados, não encontramos uma solução que utilize a predição de opcodes como entrada para um classificador de família de malware. O classificador de famílias obteve uma acurácia média de 91%.", "data": "21/05/2021", "filename": "PFC_-_DAlbuquerque.pdf"}, {"_id": {"$oid": "60a860f721ef9c54a5cc8a36"}, "titulo": "IDENTIFICA¸C˜AO E REDU¸C˜AO DE ORDEM DE MODELOS DESISTEMAS LINEARES POR EXPANS˜AO MODAL OTIMIZADA", "autores": "MARCELO DE ARA´UJO OLIVEIRA", "orientadores": "Orientadores: Paulo C´esar Pellanda - Dr. ENSARoberto Ades - D.Sc.", "InstEns": "", "tipo": "pfc", "keyword": "palavras-chave nao encontradas", "resumo": "\nUm novo conceito de dominˆancia modal, baseado na resposta em frequˆencia do sis-\ntema sob estudo ´e proposto nesta tese. A an´alise de dominˆancia modal n˜ao ´e feita apenas\nde forma individualizada, como ´e comumente tratada na literatura de controle. A in-\nfluˆencia dos modos ´e avaliada de maneira conjunta, ou seja, avalia-se o erro de ajuste\nconsiderando as poss´ıveis combina¸c˜oes de modos. Com isto, um novo ponto de vista ´e\napresentado para as t´ecnicas de redu¸c˜ao de ordem de modelos por truncamento modal.\nUma forma de otimizar os valores num´ericos dos res´ıduos associados aos modos domi-\nnantes retidos no modelo reduzido ´e proposta. Consequentemente, os modos do modelo\noriginal n˜ao s˜ao preservados no reduzido, apenas os seus polos dominantes. A esse proce-\ndimento denominou-se de Expans˜ao Modal Otimizada. Dois algoritmos foram propostos\npara reduzir o esfor¸co computacional, para os casos em que as ordens dos modelos origi-\nnais sejam elevadas. O primeiro baseia-se em descartar as combina¸c˜oes de modos menos\ndominantes em cada fase do processamento. O outro, em analisar a dominˆancia em con-\njuntos reduzidos de modos por setor do plano s. O modelo original ´e decomposto em\numa soma de modelos com ordens menores, que s˜ao reduzidos e depois recompostos, de\nforma a se obter um modelo de ordem reduzida que se aproxima do original. Em ambos\nos algoritmos, o ajuste dos zeros ´e feito de maneira ´otima.\nUm m´etodo de redu¸c˜ao de ordem de modelos multivari´aveis no dom´ınio da frequˆen-\ncia, com solu¸c˜ao anal´ıtica, ´e tamb´em proposto. Uma vantagem relativa ´e que o m´etodo\nindepende de avalia¸c˜oes num´ericas e iterativas das respostas temporais. Os coeficientes do\ndenominador do modelo reduzido s˜ao obtidos por meio do c´alculo dos coeficientes de Pad´e\ne de Markov do modelo original. O ajuste dos coeficientes do polinˆomio do numerador do\nmodelo reduzido se baseia na resposta em frequˆencia do modelo original, sendo realizado\nde maneira ´otima, por minimizar uma fun¸c˜ao de ajuste convexa. No caso multivari´avel,\nos coeficientes de Pad´e e Markov relativos a cada canal s˜ao associados de forma a permitir\no c´alculo de um denominador comum aos diversos canais.\nUm procedimento para ser aplicado em m´etodos de identifica¸c˜ao no dom´ınio da\nfrequˆencia tamb´em ´e proposto com a finalidade de garantir a obten¸c˜ao de modelos es-\nt´aveis.\nUm aperfei¸coamento da metodologia de identifica¸c˜ao N2CACGO (SILVEIRA,\n2006) ´e apresentado e este possibilita a melhora do ajuste em baixas frequˆencias e a eli-\nmina¸c˜ao do erro de regime permanente da resposta temporal, sem alterar a essˆencia do\nm´etodo. A fun¸c˜ao de transferˆencia identificada continua sendo obtida pela solu¸c˜ao de um\nproblema de otimiza¸c˜ao convexo, de forma anal´ıtica e ´otima, com base em um crit´erio de\nnorma quadr´atica definido no dom´ınio da frequˆencia.\nPara explicitar limita¸c˜oes e vantagens das metodologias propostas, s˜ao apresentados\ntreze exemplos, sendo que trˆes utilizaram sinais temporais de sistemas reais, onde est˜ao\npresentes n˜ao linearidades e ru´ıdos, decorrentes do processo de aquisi¸c˜ao de dados.\n18\n", "data": "21/05/2021", "filename": "tese_Cel_Oliveira.pdf"}, {"_id": {"$oid": "60a9cf901382b8ed6678d753"}, "titulo": "APLICAÇÃO DE MACHINE LEARNING NA IDENTIFICAÇÃO DESISTEMAS CRIPTOGRÁFICOS A PARTIR DE CRIPTOGRAMAS", "autores": "GABRIEL DILLY VIEIRA FURTUOSORAFAEL FILIPE DOS SANTOS", "orientadores": "Orientador(es):IMELeandro de Mattos Ferreira, M.S", "InstEns": "IME", "tipo": "pfc", "keyword": " Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-cação Binária. SVM.", "resumo": "\nO presente trabalho apresenta técnicas de inteligência artificial aplicadas na identificação\nde algoritmos de encriptação com base em textos cifrados, problema relevante dentro do\nprocesso de criptoanálise. A partir do conjunto de artigos Reuters-21578, construiu-se três\nbases cifradas para os algoritmos criptográficos DES, RSA e ElGamal e empregou-se o\nmodelo de Aprendizado de Máquina SVM para a elaboração de um sistema de classificação\nde algoritmos criptográficos composto por três classificadores binários capazes de avaliar se\num texto foi cifrado ou não utilizando um determinado algoritmo. Como entradas para os\nmodelos de Aprendizado de Máquina, calculou-se medidas de similaridade e dissimilaridade\nentre os documentos. Ao final, foi realizada a análise de alguns experimentos realizados\ncom o sistema de classificação, a fim de avaliar a acurácia do sistema, bem como analisar o\nimpacto de alguns fatores nos resultados, como quais medidas escolher ou qual o tamanho\nda base de treino que deve ser utilizado.\nPalavras-chave: Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-\ncação Binária. SVM.\n", "data": "23/05/2021", "filename": "PFC-DillyRafael.pdf"}, {"_id": {"$oid": "60a9d0021382b8ed6678d754"}, "titulo": "CONTROLE DE TEMPERATURA POR RECONHECIMENTO FACIAL", "autores": "GENILSON MARÇAL BARROSHUGO GOMES ALVES DA SILVA", "orientadores": "Orientador(es):Sérgio dos Santos Cardoso Silva", "InstEns": "", "tipo": "pfc", "keyword": " raio de enlace. zona de Fresnel. reconhecimento facial. controle detemperatura.", "resumo": "\nA questão da saúde pública fez se muito relevante no ano de 2020 com o surto de COVID-19,\nou novo corona vírus, e com isso muitos países decidiram optar pelo isolamento social. Com\nisso, surgiu a idéia de projetar uma área de isolamento para militares infectados afastada\ndo IME, e o PIRF foi o local escolhido. E para isso será desenvolvido um sistema de\nmonitoramento em que será realizado o reconhecimento facial e a medição de temperatura\ndas pessoas que entram no local, com a geração de um relatório em um servidor com as\ninformações de temperatura de cada pessoa que entrou no local. Porém, com o Pão de\nAçúcar entre as duas unidades se faz necessário um enlace rádio intermediário com o Forte\nImbuí.\nPara isso, será calculado o enlace entre IME, Forte Imbuí e PIRF, utilizaremos um software\nde reconhecimento facial e será criado um software que irá monitorar a temperatura do\npessoal isolado para associar cada temperatura a cada pessoa analisada ao longo do tempo.\nA parte da ligação entre IME e PIRF não será implementada de fato, mas o cálculo\nnecessário para posterior realização será posto como anexo a este trabalho.\nPalavras-chave: raio de enlace. zona de Fresnel. reconhecimento facial. controle de\ntemperatura.\n", "data": "23/05/2021", "filename": "PFC_GomesMarcal.pdf"}, {"_id": {"$oid": "60a9d6c82c30c8c8e26b18d7"}, "titulo": "INTERAÇÃO POR HAND-TRACKING EM AMBIENTE DE REALIDADEVIRTUAL", "autores": "MATEUS CÂNDIDO LIMA DE CASTROJOÃO PEDRO DE ARAÚJO XAVIER", "orientadores": "Orientador(es):Paulo Fernando Ferreira Rosa, Jauvane Cavalcante de Oliveira,", "InstEns": "IME", "tipo": "pfc", "keyword": " Redes Neurais. Aprendizado Profundo. Realidade Virtual. Sistema deTempo Real. Análise de Imagens. Detecção de Pose.", "resumo": "\nImersão em ambientes virtuais está se tornando mais popular. Diversas empresas, como\nSamsung, Google e Facebook, investem nestas tecnologias. Apesar disto, os produtos mais\nconhecidos, como o Samgung Gear VR e o Google Card Board, não oferecem nenhum\ntipo de suporte a interação natural, implementando interação por meio de botões. Já o\nOculus Rift, do Facebook, oferece um meio de interação mais natural, usando as mãos, mas\nutiliza múltiplos sensores. Este trabalho descreve a criação de um sistema de baixo custo\nque permite a interação de um usuário com ambientes virtuais modelados em Unity e\nvisualizados através de um celular em um Google Cardboard - um óculos de realidade virtual.\nO modelo proposto para interação se baseia na aplicação de algoritmos de hand-tracking\nem quandros capturados por uma única câmera RGB do celular. O objetivo é utilizar\neste sistema para realizar uma tarefa de pick-and-place. A contribuição deste trabalho\nconsiste na criação e disponibilização do código, em um repositório open-source, do sistema\nproposto para integração em aplicações.\nPalavras-chave: Redes Neurais. Aprendizado Profundo. Realidade Virtual. Sistema de\nTempo Real. Análise de Imagens. Detecção de Pose.\n", "data": "23/05/2021", "filename": "PFC_DeCastroXavier.pdf"}, {"_id": {"$oid": "60aa7149d9449972cadbb07b"}, "titulo": "APLICAÇÃO DE MACHINE LEARNING NA IDENTIFICAÇÃO DESISTEMAS CRIPTOGRÁFICOS A PARTIR DE CRIPTOGRAMAS", "autores": "GABRIEL DILLY VIEIRA FURTUOSORAFAEL FILIPE DOS SANTOS", "orientadores": "Orientador(es):IMELeandro de Mattos Ferreira, M.S", "InstEns": "IME", "tipo": "pfc", "keyword": " Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-cação Binária. SVM.", "resumo": "\nO presente trabalho apresenta técnicas de inteligência artificial aplicadas na identificação\nde algoritmos de encriptação com base em textos cifrados, problema relevante dentro do\nprocesso de criptoanálise. A partir do conjunto de artigos Reuters-21578, construiu-se três\nbases cifradas para os algoritmos criptográficos DES, RSA e ElGamal e empregou-se o\nmodelo de Aprendizado de Máquina SVM para a elaboração de um sistema de classificação\nde algoritmos criptográficos composto por três classificadores binários capazes de avaliar se\num texto foi cifrado ou não utilizando um determinado algoritmo. Como entradas para os\nmodelos de Aprendizado de Máquina, calculou-se medidas de similaridade e dissimilaridade\nentre os documentos. Ao final, foi realizada a análise de alguns experimentos realizados\ncom o sistema de classificação, a fim de avaliar a acurácia do sistema, bem como analisar o\nimpacto de alguns fatores nos resultados, como quais medidas escolher ou qual o tamanho\nda base de treino que deve ser utilizado.\nPalavras-chave: Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-\ncação Binária. SVM.\n", "data": "23/05/2021", "filename": "PFC-DillyRafael.pdf"}, {"_id": {"$oid": "60aa715ad9449972cadbb07c"}, "titulo": "APLICAÇÃO DE MACHINE LEARNING NA IDENTIFICAÇÃO DESISTEMAS CRIPTOGRÁFICOS A PARTIR DE CRIPTOGRAMAS", "autores": "GABRIEL DILLY VIEIRA FURTUOSORAFAEL FILIPE DOS SANTOS", "orientadores": "Orientador(es):IMELeandro de Mattos Ferreira, M.S", "InstEns": "IME", "tipo": "pfc", "keyword": " Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-cação Binária. SVM.", "resumo": "\nO presente trabalho apresenta técnicas de inteligência artificial aplicadas na identificação\nde algoritmos de encriptação com base em textos cifrados, problema relevante dentro do\nprocesso de criptoanálise. A partir do conjunto de artigos Reuters-21578, construiu-se três\nbases cifradas para os algoritmos criptográficos DES, RSA e ElGamal e empregou-se o\nmodelo de Aprendizado de Máquina SVM para a elaboração de um sistema de classificação\nde algoritmos criptográficos composto por três classificadores binários capazes de avaliar se\num texto foi cifrado ou não utilizando um determinado algoritmo. Como entradas para os\nmodelos de Aprendizado de Máquina, calculou-se medidas de similaridade e dissimilaridade\nentre os documentos. Ao final, foi realizada a análise de alguns experimentos realizados\ncom o sistema de classificação, a fim de avaliar a acurácia do sistema, bem como analisar o\nimpacto de alguns fatores nos resultados, como quais medidas escolher ou qual o tamanho\nda base de treino que deve ser utilizado.\nPalavras-chave: Criptografia. DES. RSA. ElGamal. Aprendizado de Máquina. Classifi-\ncação Binária. SVM.\n", "data": "23/05/2021", "filename": "PFC-DillyRafael.pdf"}]